function determineHeir() {
    const relation = document.getElementById('relationship').value;
    const result = document.getElementById('result');
    let message = "";

    const queue = {
        first: ["balasy", "zhubaiy", "akesi", "anasy"],
        firstRep: ["nameresi", "shoberesi"],
        second: ["tuğan-agasy", "tuğan-apatasi", "tuğan-baýyry", "tuğan-qarindasy", "atasy", "azhesi"],
        secondRep: ["jiieni", "nemere-inisi"],
        third: ["ake-ded", "ana-tetya", "nagashy-aga", "nagashy-tetya"],
        thirdRep: ["nemere-aga", "nemere-apasy"],
        fourth: ["argy-atasy", "argy-azhesi"],
        fifth: ["shobere-ini", "jienshary", "atasy-agasy", "azhesi-karindasy"],
        sixth: ["pravnuki", "dvojur-plem", "dvojur-dyadi"],
        seventh: ["ogey-ini", "ogey-apasy", "ogey-uly", "ogey-kyzy", "ogey-ake", "ogey-sheshe"],
        eighth: ["asiyraydy"]
    };

    const descriptions = {
        first: "Сіз бірінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз бар. Мұраны алу үшін нотариусқа жүгініңіз. Мұра өзге бірінші кезектегі мұрагерлермен теңдей бөлінеді.",
        firstRep: "Сіз ұсыну құқығы бойынша бірінші кезектегі мұрагерсіз. Бұл дегеніміз, сіз мұраны келесі жағдайда аласыз: \n - Егер бірінші кезек бойынша мұраны алуға құқығы болған (мұра қалдырушының баласы болған), алайда мұра ашылғанға дейін немесе мұра қалдырушымен бір уақытта қайтыс болған әкеңіз немесе шешеңіз болса.",
        second: "Сіз екінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші кезектегі мұрагерлер болмаса.",
        secondRep: "Сіз ұсыну құқығы бойынша екінші кезектегі мұрагерсіз. Бұл дегеніміз, сіз мұраны келесі жағдайда аласыз: \n - Егер екінші кезек бойынша мұра алуға құқығы болған, мұра қалдырушының бiр әке, бiр шешеден туған және әкесi немесе шешесi бөлек аға-iнiсі мен апа-қарындасы болып табылатын, алайда мұра ашылғанға дейін немесе мұра қалдырушымен бір уақытта қайтыс болған әкеңіз немесе шешеңіз болса.",
        third: "Сіз үшінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші және екінші кезектегі мұрагерлер болмаса.",
        thirdRep: "Сіз ұсыну құқығы бойынша үшінші кезектегі мұрагерсіз. Бұл дегеніміз, сіз мұраны келесі жағдайда аласыз: \n - Егер үшінші кезек бойынша мұраны алуға құқығы болған, алайда мұра ашылғанға дейін немесе мұра қалдырушымен бір уақытта қайтыс болған әкеңіз немесе шешеңіз болса.",
        fourth: "Сіз төртінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші, екінші және үшінші кезектегі мұрагерлер болмаса.",
        fifth: "Сіз бесінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші, екінші, үшінші және төртінші кезектегі мұрагерлер болмаса.",
        sixth: "Сіз алтыншы кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші, екінші, үшінші, төртінші, және бесінші кезектегі мұрагерлер болмаса.",
        seventh: "Сіз жетінші кезектегі мұрагерсіз. Сіздің мұраны алуға құқығыңыз келесі жағдайда болады: \n - Бірінші, екінші, үшінші, төртінші, бесінші және алтыншы кезектегі мұрагерлер болмаса; \n - Мұра қалдырушымен кемінде 10 жыл бір отбасында тұрсаңыз.",
        eighth: "Сіз сегізінші кезектегі мұрагерсіз. Сіз келесі талаптарға сай келсеңіз, өзге мұрагерлермен қатар тең дәрежеде мұраны алуға құқылысыз: \n - 1, 2, 3, 4, 5, 6, 7 кезектегі мұрагер болып табылмасаңыз; \n - Мұраның ашылу күніне еңбекке жарамсыз болсаңыз;  \n - Мұра қалдырушы қайтыс болғанға дейін кемінде бір жыл оның асырауында болсаңыз; \n - Мұра қалдырушымен бірге тұрсаңыз."
    };

    let found = false;
    for (const [key, values] of Object.entries(queue)) {
        if (values.includes(relation)) {
            message = descriptions[key];
            found = true;
            break;
        }
    }

    if (!found) {
        message = "Қатынасыңызды таңдаңыз.";
    }

    result.innerHTML = message.replace(/\n/g, "<br>");
}
function toggleSidebar() {
    const sidebar = document.getElementById('mobile-sidebar');
    sidebar.classList.toggle('active');
}